package task1_1_2;

public class Task1_1_2 {
    public static void main(String[] args) {
        System.out.println("""
            Модуль 1. Введение в программирование. Задание №1:\s
                2. Выведите любимое стихотворение в консоль\s

            Решение:\s""");
        System.out.println("Белеет парус одинокий" +
                "\nВ тумане моря голубом...");
    }
}
