package task1_1_3;

public class Task1_1_3 {
    public static void main(String[] args) {
        System.out.println("""
            Модуль 1. Введение в программирование. Задание №1:\s
                3. Покажите в IDEA: Project explorer (область слева со списком файлов),
                область с кодом, номера строк кода. Окошко, в котором выводится результат
                программы. Скройте и выведите обратно project explorer.\s

            Решение:\s""");
        System.out.println("Область с кодом находится справа от области со структурой проекта, т.е. с файлами и " +
                "папками. Номера строк находятся на вертикальной линейке слева от области кода. Окошко, в котором " +
                "выводится результат программы называется \"Консоль\" и находится ниже области с кодом, равно " +
                "как и области со структурой проекта (Project explorer). Чтобы скрыть Project explorer, нужно " +
                "кликнуть два раза левой кнопкой мыши на планке над областью с кодом (редактором кода), т.е. как " +
                "бы по \"потолку\" редактора кода. Чтобы показать Project explorer нужно кликнуть два раза " +
                "левой кнопкой мыши по названию самого класса вверху справа, в данном случае по \"Task1_1_3\".");
    }
}
