package task1_1_13;

public class Task1_1_13 {
    public static void main(String[] args) {
        System.out.println("""
            Задание:\s
            Модуль 1. Введение в программирование. Задание №1:\s
                13. Попробуйте сложить строку с числом пи. Что получилось?\s

            Решение:\s""");

        System.out.println("Сложить строку с числом пи нельзя, поскольку это переменные разных типов. " +
                "Java не позволяет производить такие арифметические действия с переменными разных типов.");
    }
}
