package task1_1_12;

public class Task1_1_12 {
    public static void main(String[] args) {
        System.out.println("""
            Задание:\s
            Модуль 1. Введение в программирование. Задание №1:\s
                12. Попробуйте вычесть, разделить две строки.\s

            Решение:\s""");

        System.out.println("Вычесть, разделить две строки тоже нельзя, можно, например, удалить/вырезать " +
                "фрагмент строки.");
    }
}
