package task1_1_10;

public class Task1_1_10 {
    public static void main(String[] args) {
        System.out.println("""
            Задание:\s
            Модуль 1. Введение в программирование. Задание №1:\s
                10. Что будет, если в джаве поделить на ноль? Проверить.\s

            Решение:\s""");

        double i = 10 / 0;
        System.out.println("Поскольку на ноль делить нельзя, джава по результату выдаёт ошибку");
//        System.out.println(i);
    }
}
