package task1_1_1;

public class Task1_1_1 {
    public static void main(String[] args) {
        System.out.println("""
            Задание:\s
            Модуль 1. Введение в программирование. Задание №1:\s
                2. Выведите ваше имя в консоль.\s

            Решение:\s""");
        System.out.println("Меня зовут Владислав.......");
    }
}
