package task1_1_11;

public class Task1_1_11 {
    public static void main(String[] args) {
        System.out.println("""
            Задание:\s
            Модуль 1. Введение в программирование. Задание №1:\s
                11. Попробуйте сложить две строки в Java. Выведите результат.\s

            Решение:\s""");

        System.out.println("Две строки в Java сложить нельзя, их можно только как бы \"склеить\".");
    }
}
